-- 初期データ投入

---------------------------------------------------------------------------------
-- ファイターリストテーブル登録
---------------------------------------------------------------------------------
INSERT INTO public.fighter_master (id, fname, nickname) VALUES 
(1, 'マリオ', 'M'),
(2, 'ドンキーコング', 'DK'),
(3, 'リンク', 'リンク'),
(4, 'サムス・ダークサムス', 'ダムス'),
(6, 'ヨッシー', 'ヨッシー'),
(7, 'カービィ', 'KB'),
(8, 'フォックス', 'FX'),
(9, 'ピカチュウ', 'ピカ'),
(10, 'ルイージ', 'L'),
(11, 'ネス', 'ネス'),
(12, 'キャプテン・ファルコン', 'CF'),
(13, 'プリン', 'プリン'),
(14, 'ピーチ・デイジー', 'ピチデ'),
(16, 'クッパ', 'カメ'),
(17, 'アイスクライマー', 'アイクラ'),
(18, 'シーク', 'シーク'),
(19, 'ゼルダ', 'ゼルダ'),
(20, 'ドクターマリオ', 'ドクマリ'),
(21, 'ピチュー', 'ピチュー'),
(22, 'ファルコ', 'ファルコ'),
(23, 'マルス', 'マルス'),
(24, 'ルキナ', 'ルキナ'),
(25, 'こどもリンク', 'ヤンリン'),
(26, 'ガノンドルフ', 'ガノン'),
(27, 'ミュウツー', 'M2'),
(28, 'ロイ', 'ロイ'),
(29, 'クロム', 'クロム'),
(30, 'Mr.ゲーム&ウォッチ', 'ゲッチ'),
(31, 'メタナイト', 'メタ'),
(32, 'ピット・ブラックピット', 'ブラピ'),
(34, 'ゼロスーツサムス', 'ゼロサム'),
(35, 'ワリオ', 'ワリオ'),
(36, 'スネーク', 'スネーク'),
(37, 'アイク', 'アイクラ'),
(38, 'ポケモントレーナー', 'ポケトレ'),
(39, 'ディディーコング', 'DD'),
(40, 'リュカ', 'リュカ'),
(41, 'ソニック', 'ソニック'),
(42, 'デデデ', 'DDD'),
(43, 'ピクミン＆オリマー', 'ピクオリ'),
(44, 'ルカリオ', 'ルカリオ'),
(45, 'ロボット', 'ロボット'),
(46, 'トゥーンリンク', 'トリン'),
(47, 'ウルフ', 'ウルフ'),
(48, 'むらびと', 'むらびと'),
(49, 'ロックマン', '岩'),
(50, 'Wii Fit トレーナー', 'フィットレ'),
(51, 'ロゼッタ＆チコ', 'ロゼチコ'),
(52, 'リトルマック', 'リトマ'),
(53, 'ゲッコウガ', 'ゲコ'),
(54, '格闘Mii', 'カクミ'),
(55, '剣術Mii', 'ケンミ'),
(56, '射撃Mii', 'シャゲミ'),
(57, 'パルテナ', 'パルテナ'),
(58, 'パックマン', '金玉'),
(59, 'ルフレ', 'ルフレ'),
(60, 'シュルク', '手越'),
(61, 'クッパJr.', 'パジュニ'),
(62, 'ダックハント', '犬'),
(63, 'リュウ', 'リュウ'),
(64, 'ケン', '剣'),
(65, 'クラウド', 'クラウド'),
(66, 'カムイ', 'カムイ'),
(67, 'ベヨネッタ', 'ベヨネッタ'),
(68, 'インクリング', 'イカ'),
(69, 'リドリー', 'リドリー'),
(70, 'シモン・リヒター', 'シモリヒ'),
(72, 'キングクルール', 'キンクル'),
(73, 'しずえ', 'しずえ'),
(74, 'ガオガエン', 'ガエン'),
(75, 'パックンフラワー', '草'),
(76, 'ジョーカー', 'J'),
(77, '勇者', '勇者'),
(78, 'バンジョー＆カズーイ', 'バンカズ'),
(79, 'テリー', 'テリー'),
(80, 'ベレトス', 'ベレトス'),
(81, 'ミェンミェン', 'メン'),
(82, 'スティーブ', 'スティーブ'),
(83, 'セフィロス', 'セフィロス'),
(84, 'ホムヒカ', 'ホムヒカ'),
(85, 'カズヤ', 'カズヤ'),
(86, 'ソラ', 'ソラ');

---------------------------------------------------------------------------------
-- マッチング履歴テーブル
---------------------------------------------------------------------------------
INSERT INTO public.history_match (history_match_date, useid, fid, result) VALUES 
('2025-02-16 22:12:20', 7, 12, 'win'),
('2025-02-16 23:02:40', 7, 12, 'loss'),
('2024-03-01 01:10:20', 7, 30, 'win'),
('2025-02-13 18:20:12', 12, 12, 'loss'),
('2025-02-12 12:23:42', 12, 3, 'win');

---------------------------------------------------------------------------------
-- レート履歴テーブル
---------------------------------------------------------------------------------
INSERT INTO public.history_rate (history_rate_date, useid, rate) VALUES 
('2025-02-16 22:12:20', 7, 1230),
('2025-02-16 23:02:40', 7, 1102),
('2024-03-01 01:10:20', 7, 1320),
('2025-02-13 18:20:12', 12, 1412),
('2025-02-12 12:23:42', 12, 1360);

---------------------------------------------------------------------------------
-- プレイヤー管理テーブル　データ移行
---------------------------------------------------------------------------------
INSERT INTO public.used_fighters_manager (
    useid, 
    current_rate, 
    del_flg
)
SELECT
    m.fnum AS useid,
    m.current_rate AS current_rate,
    false AS del_flg
FROM
    sumabura.myfighters AS m;

---------------------------------------------------------------------------------
-- 勝率管理テーブル　データ移行
---------------------------------------------------------------------------------
INSERT INTO public.win_loss_manager (
    useid, 
    fid, 
    win_cnt, 
    loss_cnt, 
    memo
)
SELECT
    w.mynum AS useid,
    w.fnum AS fid,
    w.win AS win_cnt,
    w.loss AS loss_cnt,
    LEFT(w.taisaku, 100) AS memo
FROM
    sumabura.win_loss_manager AS w
INNER JOIN
    sumabura.fighter_list AS l
    ON w.mynum = l.fnum;